INSERT INTO weapons (weapon_name, weapon_type, base_atk, w_hp, w_atk, w_def, w_crit_damage, w_crit_rate) VALUES 
('天空之刃', '單手劍', 608, 0, 0.551, 0, 0, 0),
('斫峰之刃', '單手劍', 608, 0, 0.496, 0, 0, 0),
('波亂月白經津', '單手劍', 608, 0, 0, 0, 0, 0.331),
('磐岩結綠', '單手劍', 542, 0, 0, 0, 0, 0.441),
('蒼古自由之誓', '單手劍', 608, 0, 0.198, 0, 0, 0),
('霧切之回光', '單手劍', 674, 0, 0, 0, 0.441, 0),
('風鷹劍', '單手劍', 674, 0, 0, 0, 0.413, 0),
('聖顯之鑰', '單手劍', 542, 0.662, 0, 0, 0, 0),
('裁葉萃光', '單手劍', 542, 0, 0, 0, 0.882, 0),
('靜水流湧之輝', '單手劍', 542, 0, 0, 0, 0.882, 0),
('有樂御簾切', '單手劍', 542, 0, 0, 0, 0.882, 0);

INSERT INTO weapons (weapon_name, weapon_type, base_atk, w_hp, w_atk, w_def, w_crit_damage, w_crit_rate) VALUES  
('狼的末路', '雙手劍', 608, 0, 0.496, 0, 0, 0),
('天空之傲', '雙手劍', 674, 0, 0.368, 0, 0, 0),
('松籟響起之時', '雙手劍', 741, 0, 0.207, 0, 0, 0),
('無工之劍', '雙手劍', 608, 0, 0.496, 0, 0, 0),
('赤角石潰杵', '雙手劍', 542, 0, 0, 0, 0.882, 0),
('葦海信標', '雙手劍', 608, 0, 0, 0, 0, 0.331),
('裁斷', '雙手劍', 674, 0, 0, 0, 0, 0.221);

INSERT INTO weapons (weapon_name, weapon_type, base_atk, w_hp, w_atk, w_def, w_crit_damage, w_crit_rate) VALUES  
('天空之翼', '弓', 674, 0, 0, 0, 0, 0.221),
('冬極白星', '弓', 608, 0, 0, 0, 0, 0.331),
('終末嗟嘆之詩', '弓', 608, 0, 0.551, 0, 0, 0),
('阿莫斯之弓', '弓', 608, 0, 0.496, 0, 0, 0),
('飛雷之弦振', '弓', 608, 0, 0, 0, 0.662, 0),
('若水', '弓', 542, 0, 0, 0, 0.882, 0),
('獵人之徑', '弓', 542, 0, 0, 0, 0, 0.441),
('最初的大魔術', '弓', 608, 0, 0, 0, 0.662, 0);

INSERT INTO weapons (weapon_name, weapon_type, base_atk, w_hp, w_atk, w_def, w_crit_damage, w_crit_rate) VALUES 
('天空之脊', '長柄武器', 674, 0, 0.368, 0, 0 ,0),
('和璞鳶', '長柄武器', 674, 0, 0, 0, 0 ,0.221),
('息災', '長柄武器', 741, 0, 0.165, 0, 0 ,0),
('護摩之杖', '長柄武器', 608, 0, 0, 0, 0.662, 0),
('薙草之稻光', '長柄武器', 608, 0, 0.551, 0, 0 ,0),
('貫虹之槊', '長柄武器', 608, 0.496, 0, 0, 0 ,0),
('赤沙之杖', '長柄武器', 542, 0, 0, 0, 0 ,0.441),
('赤月之形', '長柄武器', 674, 0, 0, 0, 0 ,0.221);

INSERT INTO weapons (weapon_name, weapon_type, base_atk, w_hp, w_atk, w_def, w_crit_damage, w_crit_rate) VALUES 
('天空之卷', '法器', 674, 0, 0.331, 0, 0 ,0),
('四風原典', '法器', 608, 0, 0, 0, 0 ,0.331),
('不滅月華', '法器', 608, 0.496, 0, 0, 0 ,0),
('塵世之鎖', '法器', 608, 0, 0.496, 0, 0 ,0),
('神樂之真意', '法器', 608, 0, 0, 0, 0.662 ,0),
('千夜浮夢', '法器', 542, 0, 0.265, 0, 0 ,0),
('圖萊杜拉的回憶', '法器', 674, 0, 0, 0, 0.441 ,0),
('碧落之瓏', '法器', 608, 0.496, 0, 0, 0 ,0),
('萬世流湧大典', '法器', 542, 0, 0, 0, 0.882 ,0),
('金流監督', '法器', 674, 0, 0, 0, 0 ,0.221),
('鶴鳴餘音', '法器', 741, 0, 0.165, 0, 0 ,0);